Repository: alaamrs95-droid/smart-recruitment
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: AI-powered matching between job requirements and candidate skills.
ar: مطابقة مدعومة بالذكاء الاصطناعي بين متطلبات الوظائف ومهارات المرشحين.

source: Fast & Efficient
ar: سريع وفعال

source: Reduce hiring time by 70%% with our intelligent screening system.
ar: قلل وقت التوظيف بنسبة 70%% باستخدام نظام الفحص الذكي لدينا.

source: Secure & Reliable
ar: آمن وموثوق

source: Your data is protected with enterprise-grade security.
ar: يتم حماية بياناتك بأمان على مستوى المؤسسات.

source: How It Works
ar: كيف تعمل

source: Create your account as employer or candidate.
ar: أنشئ حسابك كصاحب عمل أو مرشح.

source: Create Profile
ar: إنشاء ملف شخصي

source: Add your details, skills, or job requirements.
ar: أضف تفاصيلك أو مهاراتك أو متطلبات الوظيفة.

source: Our AI system finds the best matches for you.
ar: يجد نظام الذكاء الاصطناعي الخاص بنا أفضل المطابقات لك.

source: Connect
ar: اتصال

source: Communicate and hire the perfect match.
ar: تواصل وقم بتوظيف المطابقة المثالية.

source: AI Matcher
ar: المطابق الذكي

source: My Matches
ar: مطابقاتي
