Repository: alaamrs95-droid/smart-recruitment
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Candidate Dashboard
ar: لوحة تحكم المرشح

source: Welcome back,
ar: مرحباً بعودتك،

source: Upload Resume
ar: رفع السيرة الذاتية

source: Build Resume
ar: إنشاء سيرة ذاتية

source: Resume Profile
ar: ملف السيرة الذاتية

source: Manage
ar: إدارة

source: Processed Resumes
ar: السير الذاتية المعالجة

source: Total Matches
ar: إجمالي المطابقات

source: View All Matches
ar: عرض جميع المطابقات

source: Excellent Matches
ar: مطابقات ممتازة

source: View Matches
ar: عرض المطابقات

source: Profile Completeness
ar: اكتمال الملف الشخصي

source: Top Skills to Learn
ar: أهم المهارات للتعلم

source: jobs need this
ar: وظائف تحتاج هذه المهارة

source: No missing skills identified.
ar: لم يتم تحديد مهارات ناقصة.

source: Recent Jobs
ar: الوظائف الأخيرة

source: View Details
ar: عرض التفاصيل

source: No recent jobs available.
ar: لا توجد وظائف حديثة متاحة.

source: Recommended Jobs for You
ar: وظائف موصى بها لك

source: AI Recommended
ar: موصى بها بالذكاء الاصطناعي

source: Upload a resume to get personalized recommendations!
ar: ارفع سيرة ذاتية للحصول على توصيات مخصصة!

source: Employer Dashboard
ar: لوحة تحكم صاحب العمل

source: Create New Job
ar: إنشاء وظيفة جديدة

source: Total Jobs
ar: إجمالي الوظائف

source: Active Jobs
ar: الوظائف النشطة

source: Total Applications
ar: إجمالي الطلبات

source: AI Matches
ar: مطابقات الذكاء الاصطناعي

source: My Jobs
ar: وظائفي

source: Title
ar: العنوان

source: Status
ar: الحالة

source: Created At
ar: تاريخ الإنشاء

source: Actions
ar: الإجراءات

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Matches
ar: مطابقات

source: No jobs yet. Create your first job!
ar: لا توجد وظائف بعد. أنشئ وظيفتك الأولى!

source: Login
ar: تسجيل الدخول

source: Login to Your Account
ar: تسجيل الدخول إلى حسابك

source: Username or Email
ar: اسم المستخدم أو البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Don't have an account?
ar: ليس لديك حساب؟

source: Register here
ar: سجل هنا

source: Register
ar: إنشاء حساب

source: Create New Account
ar: إنشاء حساب جديد

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Account Type
ar: نوع الحساب

source: Choose your role: Candidate (job seeker) or Employer (company)
ar: اختر دورك: مرشح (باحث عن عمل) أو صاحب عمل (شركة)

source: Confirm Password
ar: تأكيد كلمة المرور

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Login here
ar: سجل الدخول هنا

source: Logout
ar: تسجيل الخروج

source: Dashboard
ar: لوحة التحكم

source: My Resumes
ar: سيري الذاتية

source: Create New Job Posting
ar: إنشاء إعلان وظيفة جديد

source: Job Title
ar: المسمى الوظيفي

source: Education Level
ar: المستوى التعليمي

source: Job Description
ar: وصف الوظيفة

source: Required Skills
ar: المهارات المطلوبة

source: Separate with commas (e.g. Python, Django, PostgreSQL)
ar: افصل بفواصل (مثال: Python, Django, PostgreSQL)

source: Preferred Skills
ar: المهارات المفضلة

source: (Optional)
ar: (اختياري)

source: Separate with commas
ar: افصل بفواصل

source: Required Languages
ar: اللغات المطلوبة

source: Separate with commas (e.g. Arabic, English)
ar: افصل بفواصل (مثال: العربية، الإنجليزية)

source: Experience Years
ar: سنوات الخبرة

source: Active (Visible to candidates)
ar: نشط (مرئي للمرشحين)

source: Create Job
ar: إنشاء وظيفة

source: Back to My Jobs
ar: العودة إلى وظائفي

source: Delete Job
ar: حذف الوظيفة

source: Confirm Delete
ar: تأكيد الحذف

source: Are you sure you want to delete this job posting?
ar: هل أنت متأكد أنك تريد حذف إعلان الوظيفة هذا؟

source: Posted on
ar: نُشر في

source: This action cannot be undone!
ar: لا يمكن التراجع عن هذا الإجراء!

source: Yes, Delete It
ar: نعم، احذفه

source: Cancel
ar: إلغاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: View AI Matches
ar: عرض مطابقات الذكاء الاصطناعي

source: Apply
ar: تقدم

source: Back to Jobs
ar: العودة إلى الوظائف

source: No required skills specified.
ar: لم يتم تحديد مهارات مطلوبة.

source: No preferred skills.
ar: لا توجد مهارات مفضلة.

source: No languages specified.
ar: لم يتم تحديد لغات.

source: Job Information
ar: معلومات الوظيفة

source: Employer:
ar: صاحب العمل:

source: Posted:
ar: نُشر:

source: Status:
ar: الحالة:

source: Education Level:
ar: المستوى التعليمي:

source: Experience Required:
ar: الخبرة المطلوبة:

source: years
ar: سنوات

source: Job Listings
ar: قائمة الوظائف

source: Available Jobs
ar: الوظائف المتاحة

source: Search by title or description...
ar: البحث بالعنوان أو الوصف...

source: Filter by skill...
ar: تصفية بالمهارة...

source: Required Skills:
ar: المهارات المطلوبة:

source: Languages:
ar: اللغات:

source: No jobs match your search.
ar: لا توجد وظائف تطابق بحثك.

source: Clear Filters
ar: مسح الفلاتر

source: Update Job
ar: تحديث الوظيفة

source: Update Job Posting
ar: تحديث إعلان الوظيفة

source: My Job Postings
ar: إعلانات وظائفي

source: Posted
ar: نُشر

source: You haven't posted any jobs yet.
ar: لم تنشر أي وظائف بعد.

source: Create Your First Job
ar: أنشئ وظيفتك الأولى

source: Primary Resume
ar: السيرة الذاتية الأساسية

source: Built Resume
ar: سيرة ذاتية مبنية

source: Uploaded Resume
ar: سيرة ذاتية مرفوعة

source: Has Both
ar: يحتوي على كليهما

source: Match Score
ar: نسبة المطابقة

source: Applied for
ar: تقدم لـ

source: Resume Details
ar: تفاصيل السيرة الذاتية

source: Not specified
ar: غير محدد

source: Contact
ar: اتصال

source: Phone
ar: هاتف

source: Match Reasons
ar: أسباب المطابقة

source: Strengths
ar: نقاط القوة

source: Areas for Improvement
ar: مجالات التحسين

source: Full Analysis
ar: تحليل كامل

source: View Uploaded
ar: عرض المرفوع

source: View Built
ar: عرض المبنية

source: View Resume
ar: عرض السيرة الذاتية

source: No matches found
ar: لم يتم العثور على مطابقات

source: No candidates match your criteria at this time.
ar: لا يوجد مرشحون يطابقون معاييرك في هذا الوقت.

source: Excellent
ar: ممتاز

source: Good
ar: جيد

source: Moderate
ar: متوسط

source: Match Score:
ar: نسبة المطابقة:

source: Why this match?
ar: لماذا هذه المطابقة؟

source: Strengths:
ar: نقاط القوة:

source: Areas for Improvement:
ar: مجالات التحسين:

source: View detailed AI analysis
ar: عرض تحليل الذكاء الاصطناعي التفصيلي

source: Analysis
ar: تحليل

source: Upload a resume to enable analysis
ar: ارفع سيرة ذاتية لتمكين التحليل

source: No Analysis
ar: لا يوجد تحليل

source: View full job details
ar: عرض تفاصيل الوظيفة الكاملة

source: Job
ar: وظيفة

source: No matches in this category.
ar: لا توجد مطابقات في هذه الفئة.

source: Your Analytics
ar: تحليلاتك

source: Average Score
ar: متوسط النقاط

source: Applications
ar: الطلبات

source: Profile Complete
ar: اكتمال الملف الشخصي

source: Match Score Distribution
ar: توزيع نقاط المطابقة

source: Application Status
ar: حالة الطلب

source: Your Top Skills
ar: أفضل مهاراتك

source: Skill
ar: مهارة

source: You Have It
ar: لديكها

source: Market Demand
ar: الطلب في السوق

source: Demand %%
ar: نسبة الطلب %%

source: My Job Matches
ar: مطابقات وظائفي

source: My AI Job Matches
ar: مطابقات وظائفي بالذكاء الاصطناعي

source: Excellent:
ar: ممتاز:

source: Good:
ar: جيد:

source: Moderate:
ar: متوسط:

source: All Matches
ar: جميع المطابقات

source: Upload a resume to see personalized job matches!
ar: ارفع سيرة ذاتية لرؤية مطابقات الوظائف المخصصة!

source: Candidate Matches
ar: مطابقات المرشحين

source: AI Candidate Matches
ar: مطابقات المرشحين بالذكاء الاصطناعي

source: Post a job to see AI-matched candidates!
ar: انشر وظيفة لرؤية المرشحين المطابقين بالذكاء الاصطناعي!

source: Job Matches Summary
ar: ملخص مطابقات الوظائف

source: Top Candidate Matches for
ar: أفضل مطابقات المرشحين لـ

source: Total Matches:
ar: إجمالي المطابقات:

source: Back to Job
ar: العودة إلى الوظيفة

source: No matches found yet.
ar: لم يتم العثور على مطابقات بعد.

source: Candidate Matches for Job
ar: مطابقات المرشحين للوظيفة

source: AI Candidate Matches for
ar: مطابقات المرشحين بالذكاء الاصطناعي لـ

source: Total Resumes:
ar: إجمالي السير الذاتية:

source: Key Reasons:
ar: الأسباب الرئيسية:

source: Candidate Strengths:
ar: نقاط قوة المرشح:

source: Gaps:
ar: فجوات:

source: Top 10 Matches
ar: أفضل 10 مطابقات

source: No matching candidates found for this job.
ar: لم يتم العثور على مرشحين مطابقين لهذه الوظيفة.

source: Match Analysis
ar: تحليل المطابقة

source: AI Match Analysis
ar: تحليل المطابقة بالذكاء الاصطناعي

source: Resume
ar: السيرة الذاتية

source: Filename:
ar: اسم الملف:

source: Candidate:
ar: المرشح:

source: Uploaded:
ar: تم الرفع:

source: Title:
ar: العنوان:

source: Overall Match Score
ar: نسبة المطابقة الإجمالية

source: Key Reasons for this Match
ar: الأسباب الرئيسية لهذه المطابقة

source: Matched Required Skills
ar: المهارات المطلوبة المطابقة

source: Matched Languages
ar: اللغات المطابقة

source: Missing Required Skills
ar: المهارات المطلوبة المفقودة

source: Missing Languages
ar: اللغات المفقودة

source: Recommendations
ar: التوصيات

source: Apply Now
ar: تقدم الآن

source: Contact Candidate
ar: اتصال بالمرشح

source: Back to Matches
ar: العودة إلى المطابقات

source: Job Matches for Resume
ar: مطابقات الوظائف للسيرة الذاتية

source: AI Job Matches for
ar: مطابقات الوظائف بالذكاء الاصطناعي لـ

source: Total Jobs:
ar: إجمالي الوظائف:

source: Back to Resume
ar: العودة إلى السيرة الذاتية

source: Your Strengths:
ar: نقاط قوتك:

source: Areas to Improve:
ar: مجالات التحسين:

source: View Job
ar: عرض الوظيفة

source: No matching jobs found for this resume.
ar: لم يتم العثور على وظائف مطابقة لهذه السيرة الذاتية.

source: Certification Name
ar: اسم الشهادة

source: Issuing Organization
ar: الجهة المانحة

source: Issue Date
ar: تاريخ الإصدار

source: Expiry Date
ar: تاريخ الانتهاء

source: Leave empty if certification does not expire
ar: اتركه فارغًا إذا كانت الشهادة لا تنتهي صلاحيتها

source: Credential ID
ar: معرف الشهادة

source: Optional: Certificate ID or verification number
ar: اختياري: رقم الشهادة أو التحقق

source: Credential URL
ar: رابط الشهادة

source: Link to verify certification online
ar: رابط للتحقق من الشهادة عبر الإنترنت

source: Add Certification
ar: إضافة شهادة

source: Institution
ar: المؤسسة التعليمية

source: Degree
ar: الدرجة العلمية

source: Degree Type
ar: نوع الدرجة

source: Field of Study
ar: مجال الدراسة

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Leave empty if currently studying
ar: اتركه فارغًا إذا كنت تدرس حاليًا

source: Currently studying
ar: أدرس حاليًا

source: GPA
ar: المعدل التراكمي

source: Optional: e.g., 3.8/4.0
ar: اختياري: مثال: 3.8/4.0

source: Description
ar: الوصف

source: Additional details about your education
ar: تفاصيل إضافية عن تعليمك

source: Add Education
ar: إضافة تعليم

source: Add Work Experience
ar: إضافة خبرة عمل

source: Leave empty if you currently work here
ar: اتركه فارغًا إذا كنت تعمل هنا حاليًا

source: Describe your responsibilities and daily tasks
ar: صف مسؤولياتك والمهام اليومية

source: Highlight your key achievements and accomplishments
ar: سلط الضوء على إنجازاتك وإنجازاتك الرئيسية

source: Add Experience
ar: إضافة خبرة

source: Language
ar: اللغة

source: e.g., English, Arabic, French
ar: مثال: الإنجليزية، العربية، الفرنسية

source: Proficiency Level
ar: مستوى الكفاءة

source: Add Language
ar: إضافة لغة

source: e.g., English, Arabic, Spanish
ar: مثال: الإنجليزية، العربية، الإسبانية

source: Project Name
ar: اسم المشروع

source: Technologies Used
ar: التقنيات المستخدمة

source: e.g., Python, Django, React, PostgreSQL
ar: مثال: Python، Django، React، PostgreSQL

source: Leave empty if ongoing project
ar: اتركه فارغًا إذا كان المشروع مستمرًا

source: Project Description
ar: وصف المشروع

source: Describe the project, your role, and what it accomplishes
ar: صف المشروع ودورك وما يحققه

source: Project URL
ar: رابط المشروع

source: Link to live project or demo
ar: رابط للمشروع الحي أو العرض التوضيحي

source: GitHub URL
ar: رابط GitHub

source: Link to source code repository
ar: رابط لمستودع التعليمات البرمجية المصدرية

source: Add Project
ar: إضافة مشروع

source: Skill Name
ar: اسم المهارة

source: e.g., Python, JavaScript, Project Management
ar: مثال: Python، JavaScript، إدارة المشاريع

source: Skill Level
ar: مستوى المهارة

source: Years of Experience
ar: سنوات الخبرة

source: Optional: Number of years you have used this skill
ar: اختياري: عدد السنوات التي استخدمت فيها هذه المهارة

source: Add Skill
ar: إضافة مهارة

source: e.g., Python, JavaScript, Communication
ar: مثال: Python، JavaScript، التواصل

source: e.g., 3
ar: مثال: 3

source: Are you sure?
ar: هل أنت متأكد؟

source: This action cannot be undone. This will permanently delete the
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف الـ بشكل دائم

source: Company
ar: الشركة

source: Position
ar: المنصب

source: Leave empty if currently working here
ar: اتركه فارغًا إذا كنت تعمل هنا حاليًا

source: Currently working here
ar: أعمل هنا حاليًا

source: Key Achievements
ar: الإنجازات الرئيسية

source: List your main accomplishments and impact
ar: اذكر إنجازاتك الرئيسية وتأثيرك

source: Are you sure you want to delete this experience?
ar: هل أنت متأكد أنك تريد حذف هذه الخبرة؟

source: Save Changes
ar: حفظ التغييرات

source: Edit Personal Information
ar: تعديل المعلومات الشخصية

source: Save Information
ar: حفظ المعلومات

source: Create Resume
ar: إنشاء سيرة ذاتية

source: Resume Builder
ar: منشئ السيرة الذاتية

source: Create New Resume
ar: إنشاء سيرة ذاتية جديدة

source: Write a compelling summary that highlights your key qualifications and career goals.
ar: اكتب ملخصًا جذابًا يسلط الضوء على مؤهلاتك الرئيسية وأهدافك المهنية.

source: Quick Tips
ar: نصائح سريعة

source: Choose a descriptive title that reflects your career focus
ar: اختر عنوانًا وصفيًا يعكس تركيزك المهني

source: Keep your summary concise (2-3 sentences)
ar: احتفظ بملخصك موجزًا (2-3 جمل)

source: Highlight your most relevant skills and experience
ar: سلط الضوء على مهاراتك وخبراتك الأكثر صلة

source: You can always edit this information later
ar: يمكنك دائمًا تعديل هذه المعلومات لاحقًا

source: Default
ar: افتراضي

source: Find Matches
ar: البحث عن مطابقات

source: Edit Resume
ar: تعديل السيرة الذاتية

source: Print Resume
ar: طباعة السيرة الذاتية

source: Delete Resume
ar: حذف السيرة الذاتية

source: Professional Summary
ar: ملخص مهني

source: Personal Information
ar: المعلومات الشخصية

source: Name:
ar: الاسم:

source: Email:
ar: البريد الإلكتروني:

source: Phone:
ar: الهاتف:

source: Location:
ar: الموقع:

source: LinkedIn:
ar: لينكد إن:

source: Website:
ar: الموقع الإلكتروني:

source: No personal information added yet
ar: لم تتم إضافة معلومات شخصية بعد

source: Add Personal Information
ar: إضافة معلومات شخصية

source: Work Experience
ar: خبرة العمل

source: Present
ar: حاليًا

source: Key Achievements:
ar: الإنجازات الرئيسية:

source: No work experience added yet
ar: لم تتم إضافة خبرة عمل بعد

source: Education
ar: التعليم

source: No education information added yet
ar: لم تتم إضافة معلومات تعليمية بعد

source: Skills
ar: المهارات

source: No skills added yet
ar: لم تتم إضافة مهارات بعد

source: Add Skills
ar: إضافة مهارات

source: Languages
ar: اللغات

source: No languages added yet
ar: لم تتم إضافة لغات بعد

source: Add Languages
ar: إضافة لغات

source: Projects
ar: المشاريع

source: Technologies:
ar: التقنيات:

source: No projects added yet
ar: لم تتم إضافة مشاريع بعد

source: Add Projects
ar: إضافة مشاريع

source: Certifications
ar: الشهادات

source: Issued:
ar: أُصدرت:

source: Expires:
ar: تنتهي:

source: No certifications added yet
ar: لم تتم إضافة شهادات بعد

source: Add Certifications
ar: إضافة شهادات

source: Are you sure you want to delete this resume? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه السيرة الذاتية؟ لا يمكن التراجع عن هذا الإجراء.

source: An error occurred
ar: حدث خطأ

source: Resume Title
ar: عنوان السيرة الذاتية

source: Brief summary of your professional background and career objectives
ar: ملخص موجز لخلفيتك المهنية وأهدافك الوظيفية

source: Settings
ar: الإعدادات

source: Set as default resume
ar: تعيين كسيرة ذاتية افتراضية

source: This resume will be used by default for job matching
ar: سيتم استخدام هذه السيرة الذاتية افتراضيًا لمطابقة الوظائف

source: Inactive resumes won't be shown in job matching
ar: لن يتم عرض السير الذاتية غير النشطة في مطابقة الوظائف

source: e.g., Software Developer Resume
ar: مثال: سيرة ذاتية لمطور برمجيات

source: e.g., Experienced software developer with 5+ years in web development...
ar: مثال: مطور برمجيات ذو خبرة لأكثر من 5 سنوات في تطوير الويب...

source: My Built Resumes
ar: سيري الذاتية المبنية

source: Experience
ar: الخبرة

source: Updated
ar: محدث

source: View
ar: عرض

source: Set as Default
ar: تعيين كافتراضي

source: Duplicate
ar: نسخ

source: No resumes yet
ar: لا توجد سير ذاتية بعد

source: Create your first professional resume to get started
ar: أنشئ سيرتك الذاتية المهنية الأولى للبدء

source: Create Your First Resume
ar: أنشئ سيرتك الذاتية الأولى

source: Set this resume as your default?
ar: هل تريد تعيين هذه السيرة الذاتية كافتراضية؟

source: Create a copy of this resume?
ar: هل تريد إنشاء نسخة من هذه السيرة الذاتية؟

source: Are you sure you want to delete this resume?
ar: هل أنت متأكد أنك تريد حذف هذه السيرة الذاتية؟

source: Upload New Resume
ar: رفع سيرة ذاتية جديدة

source: Total Resumes
ar: إجمالي السير الذاتية

source: Processed
ar: مُعالَج

source: Total Job Matches
ar: إجمالي مطابقات الوظائف

source: Filename
ar: اسم الملف

source: Uploaded
ar: تم الرفع

source: Job Matches
ar: مطابقات الوظائف

source: Processing...
ar: جاري المعالجة...

source: No matches yet
ar: لا توجد مطابقات بعد

source: You haven't uploaded any resumes yet.
ar: لم ترفع أي سير ذاتية بعد.

source: Upload Your First Resume
ar: ارفع سيرتك الذاتية الأولى

source: Tips for Better Resumes
ar: نصائح لسير ذاتية أفضل

source: Format Matters
ar: التنسيق مهم

source: Use clear headings and bullet points for better parsing.
ar: استخدم عناوين واضحة ونقاط تعداد لتحليل أفضل.

source: Update Regularly
ar: تحديث منتظم

source: Keep your skills and experience up to date for better matches.
ar: احتفظ بمهاراتك وخبراتك محدثة لمطابقات أفضل.

source: Multiple Versions
ar: إصدارات متعددة

source: Upload different resumes tailored for different job types.
ar: ارفع سير ذاتية مختلفة مصممة لأنواع الوظائف المختلفة.

source: My Resume Profile
ar: ملف سيرتي الذاتية الشخصية

source: Primary Resume Type
ar: نوع السيرة الذاتية الأساسية

source: Both Resumes
ar: كلا السير الذاتيتين

source: Matching Status
ar: حالة المطابقة

source: Primary
ar: أساسي

source: Download
ar: تنزيل

source: Set as Primary
ar: تعيين كأساسي

source: Enable matching for employers
ar: تفعيل المطابقة لأصحاب العمل

source: When enabled, employers can see your resume in their matches
ar: عند التفعيل، يمكن لأصحاب العمل رؤية سيرتك الذاتية في مطابقاتهم

source: Both (Prioritize Built)
ar: كليهما (الأولوية للمبنية)

source: Choose which resume type employers see first in matching
ar: اختر نوع السيرة الذاتية الذي يراه أصحاب العمل أولاً في المطابقة

source: No Resume Found
ar: لم يتم العثور على سيرة ذاتية

source: You don't have any resume yet. Create or upload a resume to get started.
ar: ليس لديك أي سيرة ذاتية بعد. أنشئ أو ارفع سيرة ذاتية للبدء.

source: Uploaded on
ar: تم الرفع في

source: Back
ar: رجوع

source: File Information
ar: معلومات الملف

source: Size:
ar: الحجم:

source: Type:
ar: النوع:

source: No file uploaded for this resume.
ar: لم يتم رفع ملف لهذه السيرة الذاتية.

source: Download Original
ar: تنزيل الأصل

source: Extracted Skills
ar: المهارات المستخرجة

source: No skills extracted yet.
ar: لم يتم استخراج مهارات بعد.

source: No languages detected.
ar: لم يتم اكتشاف لغات.

source: No education information extracted.
ar: لم يتم استخراج معلومات تعليمية.

source: No experience information extracted.
ar: لم يتم استخراج معلومات خبرة.

source: Extracted Text
ar: النص المستخرج

source: Show / Hide Text
ar: إظهار/إخفاء النص

source: Browse Resumes
ar: تصفح السير الذاتية

source: Candidate Resumes
ar: سير المرشحين الذاتية

source: Browse through qualified candidates and find the perfect match for your company.
ar: تصفح بين المرشحين المؤهلين وابحث عن المطابقة المثالية لشركتك.

source: resumes
ar: سير ذاتية

source: Search by skills or education...
ar: البحث بالمهارات أو التعليم...

source: All Skills
ar: جميع المهارات

source: All Education
ar: جميع المؤهلات التعليمية

source: Processing
ar: قيد المعالجة

source: No Resumes Found
ar: لم يتم العثور على سير ذاتية

source: No resumes match your current filters.
ar: لا توجد سير ذاتية تطابق الفلاتر الحالية.

source: Contact feature will be implemented soon!
ar: سيتم تنفيذ ميزة الاتصال قريبًا!

source: Update Resume
ar: تحديث السيرة الذاتية

source: Update Your Resume
ar: تحديث سيرتك الذاتية

source: Current File:
ar: الملف الحالي:

source: Choose new file (optional)...
ar: اختر ملفًا جديدًا (اختياري)...

source: If you upload a new file, AI will re-process it automatically.
ar: إذا قمت بتحميل ملف جديد، فسيعيد الذكاء الاصطناعي معالجته تلقائيًا.

source: Back to Details
ar: العودة إلى التفاصيل

source: Browse
ar: تصفح

source: Upload Your Resume
ar: ارفع سيرتك الذاتية

source: Select Resume File
ar: اختر ملف السيرة الذاتية

source: Choose file...
ar: اختر ملفًا...

source: Upload & Process Resume
ar: رفع ومعالجة السيرة الذاتية

source: Supported formats: PDF, DOC, DOCX (Max 5MB)
ar: الصيغ المدعومة: PDF، DOC، DOCX (الحد الأقصى 5 ميجابايت)

source: After upload, AI will analyze your resume and extract skills, experience, etc.
ar: بعد الرفع، سيقوم الذكاء الاصطناعي بتحليل سيرتك الذاتية واستخراج المهارات والخبرات وما إلى ذلك.

source: Tips for better results
ar: نصائح لنتائج أفضل

source: Use clear section headings (Experience, Education, Skills)
ar: استخدم عناوين أقسام واضحة (خبرة، تعليم، مهارات)

source: List specific technical skills and tools
ar: اذكر المهارات والأدوات التقنية المحددة

source: Include certifications and degrees
ar: تضمين الشهادات والدرجات العلمية

source: Keep formatting simple and clean
ar: حافظ على التنسيق بسيطًا ونظيفًا

source: Update your resume regularly
ar: حدث سيرتك الذاتية بانتظام

source: Back to My Resumes
ar: العودة إلى سيري الذاتية

source: Skills Gap Analysis
ar: تحليل فجوة المهارات

source: Your Skill Coverage
ar: تغطية مهاراتك

source: You have %(current_skills|length)s out of %(total_market_skills)s in-demand skills
ar: لديك %(current_skills|length)s من أصل %(total_market_skills)s مهارة مطلوبة في السوق

source: Your Strengths
ar: نقاط قوتك

source: Priority Skills to Learn
ar: المهارات ذات الأولوية للتعلم

source: Demand
ar: الطلب

source: Difficulty
ar: الصعوبة

source: Learning Time
ar: وقت التعلم

source: Salary Impact
ar: تأثير الراتب

source: Smart Hiring Platform
ar: منصة التوظيف الذكي

source: Smart Hiring
ar: التوظيف الذكي

source: Intelligent recruitment platform connecting employers with qualified candidates.
ar: منصة توظيف ذكية تربط بين أصحاب العمل والمرشحين المؤهلين.

source: For Employers
ar: لأصحاب العمل

source: Post Jobs
ar: نشر وظائف

source: Find Candidates
ar: البحث عن مرشحين

source: Pricing
ar: الأسعار

source: For Candidates
ar: للمرشحين

source: Find Jobs
ar: البحث عن وظائف

source: Career Advice
ar: نصائح مهنية

source: Contact Us
ar: اتصل بنا

source: Smart Hiring. All rights reserved.
ar: التوظيف الذكي. جميع الحقوق محفوظة.

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الخدمة

source: Cookies
ar: الكوكيز

source: Home
ar: الرئيسية

source: Find Your Dream Job or Perfect Candidate
ar: ابحث عن وظيفة أحلامك أو المرشح المثالي

source: Intelligent recruitment platform connecting employers with qualified candidates using AI-powered matching.
ar: منصة توظيف ذكية تربط بين أصحاب العمل والمرشحين المؤهلين باستخدام المطابقة المدعومة بالذكاء الاصطناعي.

source: Get Started
ar: ابدأ الآن

source: Go to Dashboard
ar: اذهب إلى لوحة التحكم

source: Why Choose Our Platform
ar: لماذا تختار منصتنا

source: Smart Matching
ar: مطابقة ذكية
